Revit 2027 API
ParameterTypeId.ViewSolarstudySingledayPresetIndex Property
 "Single day presets combo"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudySingledayPresetIndex { get; }
Public Shared ReadOnly Property ViewSolarstudySingledayPresetIndex As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudySingledayPresetIndex {
	ForgeTypeId^ get ();
}
static member ViewSolarstudySingledayPresetIndex : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace